In [5]:
import pandas as pd

In [9]:
# what is dicts?
mydict = {"fname":["ali","hasan","zahra"],"lname":["rezaii","ghasemi","jamshidi"],"age":[18,20,24]}
mydict

{'fname': ['ali', 'hasan', 'zahra'],
 'lname': ['rezaii', 'ghasemi', 'jamshidi'],
 'age': [18, 20, 24]}

In [2]:
type(mydict)

dict

In [11]:
df = pd.DataFrame(mydict)

In [12]:
df

   fname     lname  age
0    ali    rezaii   18
1  hasan   ghasemi   20
2  zahra  jamshidi   24

In [13]:
type(df)

pandas.core.frame.DataFrame

In [16]:
df

   fname     lname  age
0    ali    rezaii   18
1  hasan   ghasemi   20
2  zahra  jamshidi   24

In [19]:
df.age[2]

24

In [20]:
print(df.fname[1],df.lname[1],df.age[1])

hasan ghasemi 20

In [22]:
ali = df.iloc[0]

In [23]:
ali

fname       ali
lname    rezaii
age          18
Name: 0, dtype: object

In [24]:
type(ali)

pandas.core.series.Series

In [26]:
ali.age

18

In [27]:
ali.fname

'ali'

In [28]:
ali.lname

'rezaii'

In [29]:
df

   fname     lname  age
0    ali    rezaii   18
1  hasan   ghasemi   20
2  zahra  jamshidi   24

In [31]:
df["isStudent"] = False
df

   fname     lname  age  isStudent
0    ali    rezaii   18      False
1  hasan   ghasemi   20      False
2  zahra  jamshidi   24      False

In [32]:
df[df.age >= 20]

   fname     lname  age  isStudent
1  hasan   ghasemi   20      False
2  zahra  jamshidi   24      False

In [35]:
df.loc[df.age >= 20,"isStudent"] = True
df

   fname     lname  age  isStudent
0    ali    rezaii   18      False
1  hasan   ghasemi   20       True
2  zahra  jamshidi   24       True

In [36]:
df[df.isStudent]

   fname     lname  age  isStudent
1  hasan   ghasemi   20       True
2  zahra  jamshidi   24       True

In [38]:
df[df.isStudent==False]

  fname   lname  age  isStudent
0   ali  rezaii   18      False

In [40]:
df

   fname     lname  age  isStudent
0    ali    rezaii   18      False
1  hasan   ghasemi   20       True
2  zahra  jamshidi   24       True

In [41]:
df["ageNew"] = df.age + 2
df

   fname     lname  age  isStudent  ageNew
0    ali    rezaii   18      False      20
1  hasan   ghasemi   20       True      22
2  zahra  jamshidi   24       True      26

In [42]:
df["ageCat"] = df.age>20
df

   fname     lname  age  isStudent  ageNew  ageCat
0    ali    rezaii   18      False      20   False
1  hasan   ghasemi   20       True      22   False
2  zahra  jamshidi   24       True      26    True